app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", nil], ["password", "[FILTERED]"], ["created_at", "2023-11-05 21:57:00.221472"], ["updated_at", "2023-11-05 21:57:00.221472"]]
---
  def create
    @user = User.new(user_params)
    if @user.save